{
    "version": "https://jsonfeed.org/version/1",
    "title": "Postblink.WTF",
    "description": "",
    "home_page_url": "https://postblink.wtf",
    "feed_url": "https://postblink.wtf/feed.json",
    "user_comment": "",
    "author": {
        "name": "Lucas Boyles"
    },
    "items": [
        {
            "id": "https://postblink.wtf/jamison/",
            "url": "https://postblink.wtf/jamison/",
            "title": "Jamison",
            "summary": "Here is a quick write up I did for a character in a homebrew tabletop game a friend was running. The character is an Aasimar&hellip;",
            "content_html": "\n    <blockquote class=\"blockquote\">\n      Here is a quick write up I did for a character in a homebrew tabletop game a friend was running. The character is an Aasimar warlock with a Celestial patron. I was trying to decide between playing another cleric or trying a warlock for the first time when I found the Celestial in Xanathar’s Guide to Everything. It’s basically a “heavenly” take on warlocks, the inverse of a class that’s considered “dark” or to have an evil bend. It’s a path that lets a warlock heal his or her allies between bouts of Eldritch Blast. I wanted to attach a typical dark side to my character for the sake of providing inner conflict so the character has the “Haunted One” background, leaving him stuck with a dark apparition that plagues him. Here’s my Celestial ‘lock Jamison.\n    </blockquote>\n\n  <p>\n    <strong>Early Life</strong>\n<br>\n<br>Jamison lived most of his life around Routil and grew up just to the southeast of the city, working with his family in their small farming community. He was born there thirty years ago to John and Emily. A few years later his kid sister, Sara, was born. They were happy and life was simple for a time.\n<br>\n<br>He's since left behind his family name. It was one of many steps he took to protect them. Jamison saw himself a guardian and they were his first and most important wards.\n<br>\n<br>The visions began when he was seven, his parents initially believing it was a reaction to Sara coming along. A simple case of a jealous sibling telling tales for attention. The voices started at eleven. Neither the visions or voices stopped. They prepared him for his life ahead as an Aasimar, chosen by the Gods to guard this world and given gifts from the divine residents of Mount Celestia to fight for those who could not fight for themselves.\n  </p>\n\n  <p>\n    <strong>A Guiding Light</strong>\n<br>\n<br>Jamison would come to realize his dreams were an education and even included a teacher, an angel known as Valandras. Practical and lighthearted, Val was in many ways what he strived to be and in many more what he could never become. He taught Jamison how to make his way in this world and to seek glory in the astral plane. Val strengthened his bond with the diety Helm in ways that Jamison woud not understand until he was older. And so Valandras was his patron and through their celestial pact Jamison would receive the power to heal and defend his allies.\n<br>\n<br>He would not realize until later that he'd had a darker being with me.\n<br>An Annoying Shadow\n<br>\n<br>Celestial warlocks are rare. Jamison knew he was special but hadn’t yet learned why he'd excelled at an art that many considered dark. Was he not a being of light, after all? He would not blame Val. Angelic guides see the best in the Aasimar they teach. There are some lessons that you have to learn on your own.\n<br>\n<br>Valandras had spoken to him for years of hidden knowledge he would eventually have to seek out to the north within the famed Sanctuary of Cass. So it was that shortly after turning seventeen Jamison began his journey. A trip uneventful until he met an old family friend he'd never been told about but most assuredly knew he was linked to.\n<br>\n<br>While making camp, yet a few days out from his final destination, he had found himself staring into his small campfire when he heard a voice he couldn't recognize. Not one of his typical celestial messengers.\n<br>\n<br>“You need to put that out, I'm telling you. Be quick about it.” Jamison looked up to see a tattered, cloaked figure suddenly beside him. “Hello stranger. Where did you come from?” he asked. The warlock was alert but tried to maintain a calm composure.\n<br>\n<br>The figure pulled back his hood, revealing a decayed, translucent face. There was no flesh on a good portion of it and his teeth were visible through his left cheek as he sternly whispered, “Fool! Do as I say.” He had glowing ruby eyes that grew fiery with his agitation. Jamison stumbled backwards to the ground, picking up the quarterstaff always kept within reach. He swung at the figure but hit nothing and the humanoid form disappeared.\n<br>\n<br>“Do it, now!” rang out a plea from where he’d previously stood. Jamison rose to his feet and started kicking the loose ground into his fire.\n<br>\n<br>“What’s this then?” said another unrecognizable voice. “Over here boys!”\n<br>\n<br>The bandits would beat the young warlock to within an inch of his life, mostly upset that he didn’t have any valuables worth their trouble. He awoke late the next afternoon and could barely move.\n<br>\n<br>“You listen to that god awful angel all the time. Where was he last night, boy? Huh? Hrmph!” The figure was hooded again. \"Who are you? What are-,” mumbled Jamison before he was interrupted.\n<br>\n<br>“I am Frederick, young master Jamison, and I think it’s time for us to have a chat.”\n<br>The Present\n<br>\n<br>Now Jamison finds himself in the center of the realm looking for more answers than ever. More than a decade after meeting Frederick, every day is a struggle between the gifts of light and this apparition that has plagued his family for generations. The ghost that his own parents failed to warn him about. Maybe they thought his celestial blessings prevented him from being haunted like his family had been for generations. He can only guess. He hasn't been back home in years.&nbsp;<br>\n  </p>\n\n  <p>\n    \n  </p>",
            "author": {
                "name": "Lucas Boyles"
            },
            "tags": [
                   "warlock",
                   "tabletop",
                   "d&amp;d",
                   "5e"
            ],
            "date_published": "2023-03-26T14:28:00-05:00",
            "date_modified": "2025-04-16T14:29:17-05:00"
        },
        {
            "id": "https://postblink.wtf/racing-thoughts-and-wasted-time/",
            "url": "https://postblink.wtf/racing-thoughts-and-wasted-time/",
            "title": "Racing Thoughts &amp; Wasted Time",
            "summary": "I’m sitting here at 8:30 in the evening. The room is dark, save for my monitor. Music is blaring in my headphones. I don’t want&hellip;",
            "content_html": "<section class=\"gh-content gh-canvas\">\n<p>I’m sitting here at 8:30 in the evening. The room is dark, save for my monitor. Music is blaring in my headphones. I don’t want to hear the outside world. Normally I would find something resembling calm in this situation. I’m certainly trying to.</p>\n<p>I can’t. My heart is racing for absolutely no reason. I can’t bear the thought of meeting up with anyone — I haven’t been able to all day. There are very few people in the world I’d even want to talk to. Even they don’t understand what’s going on in my head now.</p>\n<p>I have generalized anxiety disorder and it has absolutely crushed my day. I didn’t feel this way yesterday or a week ago, I haven’t felt it this strongly in a while and it’s usually pretty well-managed with the SSRI Citalopram. I’ve taken it for a little over a year now.</p>\n<p>But I screwed up. I ran out a couple of days ago and have been so busy with life that I kept forgetting to go in and get it refilled. I finally did that tonight but here I sit. Just waiting for the world to pick itself back up off my back.</p>\n<p>This has affected my entire life for as long as I can remember but I hadn’t talked to a doctor about it until last spring. It changed everything. I am so glad I did it. And while I’m here in a dark room, just going over my day and tomorrow and the rest of the month in my mind, it does help recognizing that all of this pressure, the feeling that the walls are closing in, and the obsessing over every little detail to make sure I didn’t screw up — it’s all in my head. It sucks that I can’t flip a switch and just be okay with it, of course, but it does help just recognizing it for what it is. Knowing that there’s a decent chance I’ll wake up in the morning and everything will be fine. At the very least, I have my SSRI again. Even if it’s not bright and cheery, it’s manageable.</p>\n<p>My anxiety isn’t based in or a result of depression. There are similarities between the two, for sure, but they’re not one in the same. Sometimes family and friends don’t realize this. I have extended family members that have dealt with major depression and so it’s a familiar topic. It is incredibly difficult to explain how my anxiety is different. That it has different triggers. That I’m not necessarily sad on a bad day. While I’m probably affected daily, the really bad days are few and far between. When they happen, though, they’re absolutely crushing and the thoughts that fuel them are completely irrational.</p>\n<p>For instance, earlier today I had to take something into the post office drop box. There were 3 stop signs on the way through town and someone was following me. Any other day, I’m not even thinking about driving. Today? I’m worried at each stop. Did I stop abruptly in front of the person behind me? Why are they so close? Did I do something wrong? Are they on my ass because I pissed them off? Did I stop long enough at this stop sign? Did I take too long to move forward? I had the right of way there, right? I know I had right of way. Did that other person reach their sign at the 4-way before me?</p>\n<p>I stopped at the gas station before I headed home. I said hi to the cashier. Did I smile? Was I frowning? I hope they didn’t think I was a dick. I hope they don’t remember me. I hope I don’t run into anyone I know today.</p>\n<p>When I wasn’t freaking out in my head about the mundane day I was having, I worried about all the stupid things I have said to my family, friends and the people I care about in recent weeks. Do they all think I’m an idiot? Am I sure I’m not an idiot? Am I just a giant joke in the back of their minds. Do they even count me among the people they think about in the back of their minds, ever?</p>\n<p>I suppose that’s where the depression similarities kick in. But I’m not so much sad about it. I just have to keep going over it again and again and again, even though I know everything is fine.</p>\n<p>Then there’s the future. It’s a whole other beast. You get the idea. Fear and panic and obsession. Today was a shit day. I don’t mean to sound whiny — I’m just trying to get some thoughts out about how these days happen. I’m not alone. It’s fairly common. It’s just really difficult for people who don’t deal with it to understand.</p>\n<p>Tomorrow’s gonna be better though. I’m feeling better now. My heart stopped racing. Hmm. Go figure.</p>\n</section>",
            "author": {
                "name": "Lucas Boyles"
            },
            "tags": [
                   "personal",
                   "mental health",
                   "anxiety"
            ],
            "date_published": "2018-03-02T14:30:00-06:00",
            "date_modified": "2025-04-16T14:30:42-05:00"
        }
    ]
}
